Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/pio/samrh707f18a.h
/* ========== PIO definition for ADC peripheral ========== */
#define PIN_PA0X1_ADC_AD0                          _UINT32_(0)  /**< ADC signal: ADC_AD0 on PA0 mux X1 */
#define PIO_PA0X1_ADC_AD0                          (_UINT32_(1) << 0) /**< ADC signal: ADC_AD0 */
#define PIN_PA1X1_ADC_AD1                          _UINT32_(1)  /**< ADC signal: ADC_AD1 on PA1 mux X1 */
#define PIO_PA1X1_ADC_AD1                          (_UINT32_(1) << 1) /**< ADC signal: ADC_AD1 */
#define PIN_PA2X1_ADC_AD2                          _UINT32_(2)  /**< ADC signal: ADC_AD2 on PA2 mux X1 */
#define PIO_PA2X1_ADC_AD2                          (_UINT32_(1) << 2) /**< ADC signal: ADC_AD2 */
#define PIN_PA3X1_ADC_AD3                          _UINT32_(3)  /**< ADC signal: ADC_AD3 on PA3 mux X1 */
#define PIO_PA3X1_ADC_AD3                          (_UINT32_(1) << 3) /**< ADC signal: ADC_AD3 */
#define PIN_PA4X1_ADC_AD4                          _UINT32_(4)  /**< ADC signal: ADC_AD4 on PA4 mux X1 */
#define PIO_PA4X1_ADC_AD4                          (_UINT32_(1) << 4) /**< ADC signal: ADC_AD4 */
#define PIN_PA5X1_ADC_AD5                          _UINT32_(5)  /**< ADC signal: ADC_AD5 on PA5 mux X1 */
#define PIO_PA5X1_ADC_AD5                          (_UINT32_(1) << 5) /**< ADC signal: ADC_AD5 */
#define PIN_PA6X1_ADC_AD6                          _UINT32_(6)  /**< ADC signal: ADC_AD6 on PA6 mux X1 */
#define PIO_PA6X1_ADC_AD6                          (_UINT32_(1) << 6) /**< ADC signal: ADC_AD6 */
#define PIN_PA7X1_ADC_AD7                          _UINT32_(7)  /**< ADC signal: ADC_AD7 on PA7 mux X1 */
#define PIO_PA7X1_ADC_AD7                          (_UINT32_(1) << 7) /**< ADC signal: ADC_AD7 */
#define PIN_PA8X1_ADC_AD8                          _UINT32_(8)  /**< ADC signal: ADC_AD8 on PA8 mux X1 */
#define PIO_PA8X1_ADC_AD8                          (_UINT32_(1) << 8) /**< ADC signal: ADC_AD8 */
#define PIN_PA9X1_ADC_AD9                          _UINT32_(9)  /**< ADC signal: ADC_AD9 on PA9 mux X1 */
#define PIO_PA9X1_ADC_AD9                          (_UINT32_(1) << 9) /**< ADC signal: ADC_AD9 */
#define PIN_PA10X1_ADC_AD10                        _UINT32_(10) /**< ADC signal: ADC_AD10 on PA10 mux X1 */
#define PIO_PA10X1_ADC_AD10                        (_UINT32_(1) << 10) /**< ADC signal: ADC_AD10 */
#define PIN_PA11X1_ADC_AD11                        _UINT32_(11) /**< ADC signal: ADC_AD11 on PA11 mux X1 */
#define PIO_PA11X1_ADC_AD11                        (_UINT32_(1) << 11) /**< ADC signal: ADC_AD11 */
#define PIN_PA12X1_ADC_AD12                        _UINT32_(12) /**< ADC signal: ADC_AD12 on PA12 mux X1 */
#define PIO_PA12X1_ADC_AD12                        (_UINT32_(1) << 12) /**< ADC signal: ADC_AD12 */
#define PIN_PA13X1_ADC_AD13                        _UINT32_(13) /**< ADC signal: ADC_AD13 on PA13 mux X1 */
#define PIO_PA13X1_ADC_AD13                        (_UINT32_(1) << 13) /**< ADC signal: ADC_AD13 */
#define PIN_PA14X1_ADC_AD14                        _UINT32_(14) /**< ADC signal: ADC_AD14 on PA14 mux X1 */
#define PIO_PA14X1_ADC_AD14                        (_UINT32_(1) << 14) /**< ADC signal: ADC_AD14 */
#define PIN_PA15X1_ADC_AD15                        _UINT32_(15) /**< ADC signal: ADC_AD15 on PA15 mux X1 */
#define PIO_PA15X1_ADC_AD15                        (_UINT32_(1) << 15) /**< ADC signal: ADC_AD15 */
#define PIN_PC30A_ADC_ADTRG                        _UINT32_(94) /**< ADC signal: ADC_ADTRG on PC30 mux A */
#define MUX_PC30A_ADC_ADTRG                        _UINT32_(0)  /**< ADC signal line function value: ADC_ADTRG */
#define PIO_PC30A_ADC_ADTRG                        (_UINT32_(1) << 30) /**< ADC signal: ADC_ADTRG */
/* ========== PIO definition for DACC peripheral ========== */
#define PIN_PD31X1_DACC_DAC0                       _UINT32_(127) /**< DACC signal: DACC_DAC0 on PD31 mux X1 */
#define PIO_PD31X1_DACC_DAC0                       (_UINT32_(1) << 31) /**< DACC signal: DACC_DAC0 */
#define PIN_PD28X1_DACC_DAC2                       _UINT32_(124) /**< DACC signal: DACC_DAC2 on PD28 mux X1 */
#define PIO_PD28X1_DACC_DAC2                       (_UINT32_(1) << 28) /**< DACC signal: DACC_DAC2 */
#define PIN_PD30X1_DACC_DAC1N                      _UINT32_(126) /**< DACC signal: DACC_DAC1N on PD30 mux X1 */
#define PIO_PD30X1_DACC_DAC1N                      (_UINT32_(1) << 30) /**< DACC signal: DACC_DAC1N */
#define PIN_PD29X1_DACC_DAC1P                      _UINT32_(125) /**< DACC signal: DACC_DAC1P on PD29 mux X1 */
#define PIO_PD29X1_DACC_DAC1P                      (_UINT32_(1) << 29) /**< DACC signal: DACC_DAC1P */
#define PIN_PC29A_DACC_DATRG                       _UINT32_(93) /**< DACC signal: DACC_DATRG on PC29 mux A */
#define MUX_PC29A_DACC_DATRG                       _UINT32_(0)  /**< DACC signal line function value: DACC_DATRG */
#define PIO_PC29A_DACC_DATRG                       (_UINT32_(1) << 29) /**< DACC signal: DACC_DATRG */
/* ========== PIO definition for FLEXCOM0 peripheral ========== */
#define PIN_PA21A_FLEXCOM0_IO0                     _UINT32_(21) /**< FLEXCOM0 signal: FLEXCOM0_IO0 on PA21 mux A */
#define MUX_PA21A_FLEXCOM0_IO0                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO0 */
#define PIO_PA21A_FLEXCOM0_IO0                     (_UINT32_(1) << 21) /**< FLEXCOM0 signal: FLEXCOM0_IO0 */
#define PIN_PA22A_FLEXCOM0_IO1                     _UINT32_(22) /**< FLEXCOM0 signal: FLEXCOM0_IO1 on PA22 mux A */
#define MUX_PA22A_FLEXCOM0_IO1                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO1 */
#define PIO_PA22A_FLEXCOM0_IO1                     (_UINT32_(1) << 22) /**< FLEXCOM0 signal: FLEXCOM0_IO1 */
#define PIN_PA17A_FLEXCOM0_IO2                     _UINT32_(17) /**< FLEXCOM0 signal: FLEXCOM0_IO2 on PA17 mux A */
#define MUX_PA17A_FLEXCOM0_IO2                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO2 */
#define PIO_PA17A_FLEXCOM0_IO2                     (_UINT32_(1) << 17) /**< FLEXCOM0 signal: FLEXCOM0_IO2 */
#define PIN_PA26A_FLEXCOM0_IO2                     _UINT32_(26) /**< FLEXCOM0 signal: FLEXCOM0_IO2 on PA26 mux A */
#define MUX_PA26A_FLEXCOM0_IO2                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO2 */
#define PIO_PA26A_FLEXCOM0_IO2                     (_UINT32_(1) << 26) /**< FLEXCOM0 signal: FLEXCOM0_IO2 */
#define PIN_PA18A_FLEXCOM0_IO3                     _UINT32_(18) /**< FLEXCOM0 signal: FLEXCOM0_IO3 on PA18 mux A */
#define MUX_PA18A_FLEXCOM0_IO3                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO3 */
#define PIO_PA18A_FLEXCOM0_IO3                     (_UINT32_(1) << 18) /**< FLEXCOM0 signal: FLEXCOM0_IO3 */
#define PIN_PA28A_FLEXCOM0_IO3                     _UINT32_(28) /**< FLEXCOM0 signal: FLEXCOM0_IO3 on PA28 mux A */
#define MUX_PA28A_FLEXCOM0_IO3                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO3 */
#define PIO_PA28A_FLEXCOM0_IO3                     (_UINT32_(1) << 28) /**< FLEXCOM0 signal: FLEXCOM0_IO3 */
#define PIN_PA25A_FLEXCOM0_IO4                     _UINT32_(25) /**< FLEXCOM0 signal: FLEXCOM0_IO4 on PA25 mux A */
#define MUX_PA25A_FLEXCOM0_IO4                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO4 */
#define PIO_PA25A_FLEXCOM0_IO4                     (_UINT32_(1) << 25) /**< FLEXCOM0 signal: FLEXCOM0_IO4 */
#define PIN_PA24A_FLEXCOM0_IO5                     _UINT32_(24) /**< FLEXCOM0 signal: FLEXCOM0_IO5 on PA24 mux A */
#define MUX_PA24A_FLEXCOM0_IO5                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO5 */
#define PIO_PA24A_FLEXCOM0_IO5                     (_UINT32_(1) << 24) /**< FLEXCOM0 signal: FLEXCOM0_IO5 */
#define PIN_PA27A_FLEXCOM0_IO5                     _UINT32_(27) /**< FLEXCOM0 signal: FLEXCOM0_IO5 on PA27 mux A */
#define MUX_PA27A_FLEXCOM0_IO5                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO5 */
#define PIO_PA27A_FLEXCOM0_IO5                     (_UINT32_(1) << 27) /**< FLEXCOM0 signal: FLEXCOM0_IO5 */
#define PIN_PA20A_FLEXCOM0_IO6                     _UINT32_(20) /**< FLEXCOM0 signal: FLEXCOM0_IO6 on PA20 mux A */
#define MUX_PA20A_FLEXCOM0_IO6                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO6 */
#define PIO_PA20A_FLEXCOM0_IO6                     (_UINT32_(1) << 20) /**< FLEXCOM0 signal: FLEXCOM0_IO6 */
#define PIN_PA23A_FLEXCOM0_IO6                     _UINT32_(23) /**< FLEXCOM0 signal: FLEXCOM0_IO6 on PA23 mux A */
#define MUX_PA23A_FLEXCOM0_IO6                     _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO6 */
#define PIO_PA23A_FLEXCOM0_IO6                     (_UINT32_(1) << 23) /**< FLEXCOM0 signal: FLEXCOM0_IO6 */
/* ========== PIO definition for FLEXCOM1 peripheral ========== */
#define PIN_PB4B_FLEXCOM1_IO0                      _UINT32_(36) /**< FLEXCOM1 signal: FLEXCOM1_IO0 on PB4 mux B */
#define MUX_PB4B_FLEXCOM1_IO0                      _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO0 */
#define PIO_PB4B_FLEXCOM1_IO0                      (_UINT32_(1) << 4) /**< FLEXCOM1 signal: FLEXCOM1_IO0 */
#define PIN_PB5B_FLEXCOM1_IO1                      _UINT32_(37) /**< FLEXCOM1 signal: FLEXCOM1_IO1 on PB5 mux B */
#define MUX_PB5B_FLEXCOM1_IO1                      _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO1 */
#define PIO_PB5B_FLEXCOM1_IO1                      (_UINT32_(1) << 5) /**< FLEXCOM1 signal: FLEXCOM1_IO1 */
#define PIN_PA30B_FLEXCOM1_IO2                     _UINT32_(30) /**< FLEXCOM1 signal: FLEXCOM1_IO2 on PA30 mux B */
#define MUX_PA30B_FLEXCOM1_IO2                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO2 */
#define PIO_PA30B_FLEXCOM1_IO2                     (_UINT32_(1) << 30) /**< FLEXCOM1 signal: FLEXCOM1_IO2 */
#define PIN_PA29B_FLEXCOM1_IO3                     _UINT32_(29) /**< FLEXCOM1 signal: FLEXCOM1_IO3 on PA29 mux B */
#define MUX_PA29B_FLEXCOM1_IO3                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO3 */
#define PIO_PA29B_FLEXCOM1_IO3                     (_UINT32_(1) << 29) /**< FLEXCOM1 signal: FLEXCOM1_IO3 */
#define PIN_PB3B_FLEXCOM1_IO4                      _UINT32_(35) /**< FLEXCOM1 signal: FLEXCOM1_IO4 on PB3 mux B */
#define MUX_PB3B_FLEXCOM1_IO4                      _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO4 */
#define PIO_PB3B_FLEXCOM1_IO4                      (_UINT32_(1) << 3) /**< FLEXCOM1 signal: FLEXCOM1_IO4 */
#define PIN_PA15B_FLEXCOM1_IO5                     _UINT32_(15) /**< FLEXCOM1 signal: FLEXCOM1_IO5 on PA15 mux B */
#define MUX_PA15B_FLEXCOM1_IO5                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO5 */
#define PIO_PA15B_FLEXCOM1_IO5                     (_UINT32_(1) << 15) /**< FLEXCOM1 signal: FLEXCOM1_IO5 */
#define PIN_PA16B_FLEXCOM1_IO5                     _UINT32_(16) /**< FLEXCOM1 signal: FLEXCOM1_IO5 on PA16 mux B */
#define MUX_PA16B_FLEXCOM1_IO5                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO5 */
#define PIO_PA16B_FLEXCOM1_IO5                     (_UINT32_(1) << 16) /**< FLEXCOM1 signal: FLEXCOM1_IO5 */
#define PIN_PA14B_FLEXCOM1_IO6                     _UINT32_(14) /**< FLEXCOM1 signal: FLEXCOM1_IO6 on PA14 mux B */
#define MUX_PA14B_FLEXCOM1_IO6                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO6 */
#define PIO_PA14B_FLEXCOM1_IO6                     (_UINT32_(1) << 14) /**< FLEXCOM1 signal: FLEXCOM1_IO6 */
#define PIN_PA31B_FLEXCOM1_IO6                     _UINT32_(31) /**< FLEXCOM1 signal: FLEXCOM1_IO6 on PA31 mux B */
#define MUX_PA31B_FLEXCOM1_IO6                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO6 */
#define PIO_PA31B_FLEXCOM1_IO6                     (_UINT32_(1) << 31) /**< FLEXCOM1 signal: FLEXCOM1_IO6 */
/* ========== PIO definition for FLEXCOM2 peripheral ========== */
#define PIN_PD8C_FLEXCOM2_IO0                      _UINT32_(104) /**< FLEXCOM2 signal: FLEXCOM2_IO0 on PD8 mux C */
#define MUX_PD8C_FLEXCOM2_IO0                      _UINT32_(2)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO0 */
#define PIO_PD8C_FLEXCOM2_IO0                      (_UINT32_(1) << 8) /**< FLEXCOM2 signal: FLEXCOM2_IO0 */
#define PIN_PD9C_FLEXCOM2_IO1                      _UINT32_(105) /**< FLEXCOM2 signal: FLEXCOM2_IO1 on PD9 mux C */
#define MUX_PD9C_FLEXCOM2_IO1                      _UINT32_(2)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO1 */
#define PIO_PD9C_FLEXCOM2_IO1                      (_UINT32_(1) << 9) /**< FLEXCOM2 signal: FLEXCOM2_IO1 */
#define PIN_PC16A_FLEXCOM2_IO2                     _UINT32_(80) /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PC16 mux A */
#define MUX_PC16A_FLEXCOM2_IO2                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PC16A_FLEXCOM2_IO2                     (_UINT32_(1) << 16) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PD13B_FLEXCOM2_IO2                     _UINT32_(109) /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PD13 mux B */
#define MUX_PD13B_FLEXCOM2_IO2                     _UINT32_(1)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PD13B_FLEXCOM2_IO2                     (_UINT32_(1) << 13) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PD26A_FLEXCOM2_IO2                     _UINT32_(122) /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PD26 mux A */
#define MUX_PD26A_FLEXCOM2_IO2                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PD26A_FLEXCOM2_IO2                     (_UINT32_(1) << 26) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PC17A_FLEXCOM2_IO3                     _UINT32_(81) /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PC17 mux A */
#define MUX_PC17A_FLEXCOM2_IO3                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PC17A_FLEXCOM2_IO3                     (_UINT32_(1) << 17) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PD17B_FLEXCOM2_IO3                     _UINT32_(113) /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PD17 mux B */
#define MUX_PD17B_FLEXCOM2_IO3                     _UINT32_(1)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PD17B_FLEXCOM2_IO3                     (_UINT32_(1) << 17) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PD27A_FLEXCOM2_IO3                     _UINT32_(123) /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PD27 mux A */
#define MUX_PD27A_FLEXCOM2_IO3                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PD27A_FLEXCOM2_IO3                     (_UINT32_(1) << 27) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PC18A_FLEXCOM2_IO4                     _UINT32_(82) /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PC18 mux A */
#define MUX_PC18A_FLEXCOM2_IO4                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PC18A_FLEXCOM2_IO4                     (_UINT32_(1) << 18) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
#define PIN_PC31A_FLEXCOM2_IO4                     _UINT32_(95) /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PC31 mux A */
#define MUX_PC31A_FLEXCOM2_IO4                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PC31A_FLEXCOM2_IO4                     (_UINT32_(1) << 31) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
#define PIN_PD11B_FLEXCOM2_IO4                     _UINT32_(107) /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PD11 mux B */
#define MUX_PD11B_FLEXCOM2_IO4                     _UINT32_(1)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PD11B_FLEXCOM2_IO4                     (_UINT32_(1) << 11) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
#define PIN_PC19A_FLEXCOM2_IO5                     _UINT32_(83) /**< FLEXCOM2 signal: FLEXCOM2_IO5 on PC19 mux A */
#define MUX_PC19A_FLEXCOM2_IO5                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO5 */
#define PIO_PC19A_FLEXCOM2_IO5                     (_UINT32_(1) << 19) /**< FLEXCOM2 signal: FLEXCOM2_IO5 */
#define PIN_PC20A_FLEXCOM2_IO6                     _UINT32_(84) /**< FLEXCOM2 signal: FLEXCOM2_IO6 on PC20 mux A */
#define MUX_PC20A_FLEXCOM2_IO6                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO6 */
#define PIO_PC20A_FLEXCOM2_IO6                     (_UINT32_(1) << 20) /**< FLEXCOM2 signal: FLEXCOM2_IO6 */
#define PIN_PD15B_FLEXCOM2_IO6                     _UINT32_(111) /**< FLEXCOM2 signal: FLEXCOM2_IO6 on PD15 mux B */
#define MUX_PD15B_FLEXCOM2_IO6                     _UINT32_(1)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO6 */
#define PIO_PD15B_FLEXCOM2_IO6                     (_UINT32_(1) << 15) /**< FLEXCOM2 signal: FLEXCOM2_IO6 */
/* ========== PIO definition for FLEXCOM3 peripheral ========== */
#define PIN_PB22B_FLEXCOM3_IO0                     _UINT32_(54) /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PB22 mux B */
#define MUX_PB22B_FLEXCOM3_IO0                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PB22B_FLEXCOM3_IO0                     (_UINT32_(1) << 22) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PB21B_FLEXCOM3_IO1                     _UINT32_(53) /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PB21 mux B */
#define MUX_PB21B_FLEXCOM3_IO1                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PB21B_FLEXCOM3_IO1                     (_UINT32_(1) << 21) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PB17B_FLEXCOM3_IO2                     _UINT32_(49) /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PB17 mux B */
#define MUX_PB17B_FLEXCOM3_IO2                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PB17B_FLEXCOM3_IO2                     (_UINT32_(1) << 17) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PB30B_FLEXCOM3_IO2                     _UINT32_(62) /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PB30 mux B */
#define MUX_PB30B_FLEXCOM3_IO2                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PB30B_FLEXCOM3_IO2                     (_UINT32_(1) << 30) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PB18B_FLEXCOM3_IO3                     _UINT32_(50) /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PB18 mux B */
#define MUX_PB18B_FLEXCOM3_IO3                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PB18B_FLEXCOM3_IO3                     (_UINT32_(1) << 18) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PB31B_FLEXCOM3_IO3                     _UINT32_(63) /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PB31 mux B */
#define MUX_PB31B_FLEXCOM3_IO3                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PB31B_FLEXCOM3_IO3                     (_UINT32_(1) << 31) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PB20B_FLEXCOM3_IO4                     _UINT32_(52) /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PB20 mux B */
#define MUX_PB20B_FLEXCOM3_IO4                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PB20B_FLEXCOM3_IO4                     (_UINT32_(1) << 20) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
#define PIN_PB16B_FLEXCOM3_IO5                     _UINT32_(48) /**< FLEXCOM3 signal: FLEXCOM3_IO5 on PB16 mux B */
#define MUX_PB16B_FLEXCOM3_IO5                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO5 */
#define PIO_PB16B_FLEXCOM3_IO5                     (_UINT32_(1) << 16) /**< FLEXCOM3 signal: FLEXCOM3_IO5 */
#define PIN_PB29B_FLEXCOM3_IO5                     _UINT32_(61) /**< FLEXCOM3 signal: FLEXCOM3_IO5 on PB29 mux B */
#define MUX_PB29B_FLEXCOM3_IO5                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO5 */
#define PIO_PB29B_FLEXCOM3_IO5                     (_UINT32_(1) << 29) /**< FLEXCOM3 signal: FLEXCOM3_IO5 */
#define PIN_PB19B_FLEXCOM3_IO6                     _UINT32_(51) /**< FLEXCOM3 signal: FLEXCOM3_IO6 on PB19 mux B */
#define MUX_PB19B_FLEXCOM3_IO6                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO6 */
#define PIO_PB19B_FLEXCOM3_IO6                     (_UINT32_(1) << 19) /**< FLEXCOM3 signal: FLEXCOM3_IO6 */
/* ========== PIO definition for HEMC peripheral ========== */
#define PIN_PC8B_HEMC_A0                           _UINT32_(72) /**< HEMC signal: HEMC_A0 on PC8 mux B */
#define MUX_PC8B_HEMC_A0                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_A0 */
#define PIO_PC8B_HEMC_A0                           (_UINT32_(1) << 8) /**< HEMC signal: HEMC_A0 */
#define PIN_PC9B_HEMC_A1                           _UINT32_(73) /**< HEMC signal: HEMC_A1 on PC9 mux B */
#define MUX_PC9B_HEMC_A1                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_A1 */
#define PIO_PC9B_HEMC_A1                           (_UINT32_(1) << 9) /**< HEMC signal: HEMC_A1 */
#define PIN_PC10B_HEMC_A2                          _UINT32_(74) /**< HEMC signal: HEMC_A2 on PC10 mux B */
#define MUX_PC10B_HEMC_A2                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A2 */
#define PIO_PC10B_HEMC_A2                          (_UINT32_(1) << 10) /**< HEMC signal: HEMC_A2 */
#define PIN_PC11B_HEMC_A3                          _UINT32_(75) /**< HEMC signal: HEMC_A3 on PC11 mux B */
#define MUX_PC11B_HEMC_A3                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A3 */
#define PIO_PC11B_HEMC_A3                          (_UINT32_(1) << 11) /**< HEMC signal: HEMC_A3 */
#define PIN_PC12B_HEMC_A4                          _UINT32_(76) /**< HEMC signal: HEMC_A4 on PC12 mux B */
#define MUX_PC12B_HEMC_A4                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A4 */
#define PIO_PC12B_HEMC_A4                          (_UINT32_(1) << 12) /**< HEMC signal: HEMC_A4 */
#define PIN_PC13B_HEMC_A5                          _UINT32_(77) /**< HEMC signal: HEMC_A5 on PC13 mux B */
#define MUX_PC13B_HEMC_A5                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A5 */
#define PIO_PC13B_HEMC_A5                          (_UINT32_(1) << 13) /**< HEMC signal: HEMC_A5 */
#define PIN_PC14B_HEMC_A6                          _UINT32_(78) /**< HEMC signal: HEMC_A6 on PC14 mux B */
#define MUX_PC14B_HEMC_A6                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A6 */
#define PIO_PC14B_HEMC_A6                          (_UINT32_(1) << 14) /**< HEMC signal: HEMC_A6 */
#define PIN_PC15B_HEMC_A7                          _UINT32_(79) /**< HEMC signal: HEMC_A7 on PC15 mux B */
#define MUX_PC15B_HEMC_A7                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A7 */
#define PIO_PC15B_HEMC_A7                          (_UINT32_(1) << 15) /**< HEMC signal: HEMC_A7 */
#define PIN_PC16B_HEMC_A8                          _UINT32_(80) /**< HEMC signal: HEMC_A8 on PC16 mux B */
#define MUX_PC16B_HEMC_A8                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A8 */
#define PIO_PC16B_HEMC_A8                          (_UINT32_(1) << 16) /**< HEMC signal: HEMC_A8 */
#define PIN_PC17B_HEMC_A9                          _UINT32_(81) /**< HEMC signal: HEMC_A9 on PC17 mux B */
#define MUX_PC17B_HEMC_A9                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_A9 */
#define PIO_PC17B_HEMC_A9                          (_UINT32_(1) << 17) /**< HEMC signal: HEMC_A9 */
