Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/pio/samrh707f18a.h
#define PIN_PC18B_HEMC_A10                         _UINT32_(82) /**< HEMC signal: HEMC_A10 on PC18 mux B */
#define MUX_PC18B_HEMC_A10                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A10 */
#define PIO_PC18B_HEMC_A10                         (_UINT32_(1) << 18) /**< HEMC signal: HEMC_A10 */
#define PIN_PC19B_HEMC_A11                         _UINT32_(83) /**< HEMC signal: HEMC_A11 on PC19 mux B */
#define MUX_PC19B_HEMC_A11                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A11 */
#define PIO_PC19B_HEMC_A11                         (_UINT32_(1) << 19) /**< HEMC signal: HEMC_A11 */
#define PIN_PC20B_HEMC_A12                         _UINT32_(84) /**< HEMC signal: HEMC_A12 on PC20 mux B */
#define MUX_PC20B_HEMC_A12                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A12 */
#define PIO_PC20B_HEMC_A12                         (_UINT32_(1) << 20) /**< HEMC signal: HEMC_A12 */
#define PIN_PC21B_HEMC_A13                         _UINT32_(85) /**< HEMC signal: HEMC_A13 on PC21 mux B */
#define MUX_PC21B_HEMC_A13                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A13 */
#define PIO_PC21B_HEMC_A13                         (_UINT32_(1) << 21) /**< HEMC signal: HEMC_A13 */
#define PIN_PC22B_HEMC_A14                         _UINT32_(86) /**< HEMC signal: HEMC_A14 on PC22 mux B */
#define MUX_PC22B_HEMC_A14                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A14 */
#define PIO_PC22B_HEMC_A14                         (_UINT32_(1) << 22) /**< HEMC signal: HEMC_A14 */
#define PIN_PC23B_HEMC_A15                         _UINT32_(87) /**< HEMC signal: HEMC_A15 on PC23 mux B */
#define MUX_PC23B_HEMC_A15                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A15 */
#define PIO_PC23B_HEMC_A15                         (_UINT32_(1) << 23) /**< HEMC signal: HEMC_A15 */
#define PIN_PC24B_HEMC_A16                         _UINT32_(88) /**< HEMC signal: HEMC_A16 on PC24 mux B */
#define MUX_PC24B_HEMC_A16                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A16 */
#define PIO_PC24B_HEMC_A16                         (_UINT32_(1) << 24) /**< HEMC signal: HEMC_A16 */
#define PIN_PC25B_HEMC_A17                         _UINT32_(89) /**< HEMC signal: HEMC_A17 on PC25 mux B */
#define MUX_PC25B_HEMC_A17                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A17 */
#define PIO_PC25B_HEMC_A17                         (_UINT32_(1) << 25) /**< HEMC signal: HEMC_A17 */
#define PIN_PC26B_HEMC_A18                         _UINT32_(90) /**< HEMC signal: HEMC_A18 on PC26 mux B */
#define MUX_PC26B_HEMC_A18                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A18 */
#define PIO_PC26B_HEMC_A18                         (_UINT32_(1) << 26) /**< HEMC signal: HEMC_A18 */
#define PIN_PC27B_HEMC_A19                         _UINT32_(91) /**< HEMC signal: HEMC_A19 on PC27 mux B */
#define MUX_PC27B_HEMC_A19                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A19 */
#define PIO_PC27B_HEMC_A19                         (_UINT32_(1) << 27) /**< HEMC signal: HEMC_A19 */
#define PIN_PC28B_HEMC_A20                         _UINT32_(92) /**< HEMC signal: HEMC_A20 on PC28 mux B */
#define MUX_PC28B_HEMC_A20                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_A20 */
#define PIO_PC28B_HEMC_A20                         (_UINT32_(1) << 28) /**< HEMC signal: HEMC_A20 */
#define PIN_PC30X1_HEMC_BOOT_MODE0                 _UINT32_(94) /**< HEMC signal: HEMC_BOOT_MODE0 on PC30 mux X1 */
#define PIO_PC30X1_HEMC_BOOT_MODE0                 (_UINT32_(1) << 30) /**< HEMC signal: HEMC_BOOT_MODE0 */
#define PIN_PC29X1_HEMC_BOOT_MODE1                 _UINT32_(93) /**< HEMC signal: HEMC_BOOT_MODE1 on PC29 mux X1 */
#define PIO_PC29X1_HEMC_BOOT_MODE1                 (_UINT32_(1) << 29) /**< HEMC signal: HEMC_BOOT_MODE1 */
#define PIN_PA25X1_HEMC_CFG2                       _UINT32_(25) /**< HEMC signal: HEMC_CFG2 on PA25 mux X1 */
#define PIO_PA25X1_HEMC_CFG2                       (_UINT32_(1) << 25) /**< HEMC signal: HEMC_CFG2 */
#define PIN_PC0B_HEMC_D0                           _UINT32_(64) /**< HEMC signal: HEMC_D0 on PC0 mux B */
#define MUX_PC0B_HEMC_D0                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D0 */
#define PIO_PC0B_HEMC_D0                           (_UINT32_(1) << 0) /**< HEMC signal: HEMC_D0 */
#define PIN_PC1B_HEMC_D1                           _UINT32_(65) /**< HEMC signal: HEMC_D1 on PC1 mux B */
#define MUX_PC1B_HEMC_D1                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D1 */
#define PIO_PC1B_HEMC_D1                           (_UINT32_(1) << 1) /**< HEMC signal: HEMC_D1 */
#define PIN_PC2B_HEMC_D2                           _UINT32_(66) /**< HEMC signal: HEMC_D2 on PC2 mux B */
#define MUX_PC2B_HEMC_D2                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D2 */
#define PIO_PC2B_HEMC_D2                           (_UINT32_(1) << 2) /**< HEMC signal: HEMC_D2 */
#define PIN_PC3B_HEMC_D3                           _UINT32_(67) /**< HEMC signal: HEMC_D3 on PC3 mux B */
#define MUX_PC3B_HEMC_D3                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D3 */
#define PIO_PC3B_HEMC_D3                           (_UINT32_(1) << 3) /**< HEMC signal: HEMC_D3 */
#define PIN_PC4B_HEMC_D4                           _UINT32_(68) /**< HEMC signal: HEMC_D4 on PC4 mux B */
#define MUX_PC4B_HEMC_D4                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D4 */
#define PIO_PC4B_HEMC_D4                           (_UINT32_(1) << 4) /**< HEMC signal: HEMC_D4 */
#define PIN_PC5B_HEMC_D5                           _UINT32_(69) /**< HEMC signal: HEMC_D5 on PC5 mux B */
#define MUX_PC5B_HEMC_D5                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D5 */
#define PIO_PC5B_HEMC_D5                           (_UINT32_(1) << 5) /**< HEMC signal: HEMC_D5 */
#define PIN_PC6B_HEMC_D6                           _UINT32_(70) /**< HEMC signal: HEMC_D6 on PC6 mux B */
#define MUX_PC6B_HEMC_D6                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D6 */
#define PIO_PC6B_HEMC_D6                           (_UINT32_(1) << 6) /**< HEMC signal: HEMC_D6 */
#define PIN_PC7B_HEMC_D7                           _UINT32_(71) /**< HEMC signal: HEMC_D7 on PC7 mux B */
#define MUX_PC7B_HEMC_D7                           _UINT32_(1)  /**< HEMC signal line function value: HEMC_D7 */
#define PIO_PC7B_HEMC_D7                           (_UINT32_(1) << 7) /**< HEMC signal: HEMC_D7 */
#define PIN_PD5B_HEMC_NCS0                         _UINT32_(101) /**< HEMC signal: HEMC_NCS0 on PD5 mux B */
#define MUX_PD5B_HEMC_NCS0                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_NCS0 */
#define PIO_PD5B_HEMC_NCS0                         (_UINT32_(1) << 5) /**< HEMC signal: HEMC_NCS0 */
#define PIN_PD4B_HEMC_NCS1                         _UINT32_(100) /**< HEMC signal: HEMC_NCS1 on PD4 mux B */
#define MUX_PD4B_HEMC_NCS1                         _UINT32_(1)  /**< HEMC signal line function value: HEMC_NCS1 */
#define PIO_PD4B_HEMC_NCS1                         (_UINT32_(1) << 4) /**< HEMC signal: HEMC_NCS1 */
#define PIN_PD6B_HEMC_NRD                          _UINT32_(102) /**< HEMC signal: HEMC_NRD on PD6 mux B */
#define MUX_PD6B_HEMC_NRD                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_NRD */
#define PIO_PD6B_HEMC_NRD                          (_UINT32_(1) << 6) /**< HEMC signal: HEMC_NRD */
#define PIN_PD8B_HEMC_NWAIT                        _UINT32_(104) /**< HEMC signal: HEMC_NWAIT on PD8 mux B */
#define MUX_PD8B_HEMC_NWAIT                        _UINT32_(1)  /**< HEMC signal line function value: HEMC_NWAIT */
#define PIO_PD8B_HEMC_NWAIT                        (_UINT32_(1) << 8) /**< HEMC signal: HEMC_NWAIT */
#define PIN_PD7B_HEMC_NWE                          _UINT32_(103) /**< HEMC signal: HEMC_NWE on PD7 mux B */
#define MUX_PD7B_HEMC_NWE                          _UINT32_(1)  /**< HEMC signal line function value: HEMC_NWE */
#define PIO_PD7B_HEMC_NWE                          (_UINT32_(1) << 7) /**< HEMC signal: HEMC_NWE */
/* ========== PIO definition for IP1553 peripheral ========== */
#define PIN_PB28A_IP1553_ARXINN                    _UINT32_(60) /**< IP1553 signal: IP1553_ARXINN on PB28 mux A */
#define MUX_PB28A_IP1553_ARXINN                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_ARXINN */
#define PIO_PB28A_IP1553_ARXINN                    (_UINT32_(1) << 28) /**< IP1553 signal: IP1553_ARXINN */
#define PIN_PB27A_IP1553_ARXINP                    _UINT32_(59) /**< IP1553 signal: IP1553_ARXINP on PB27 mux A */
#define MUX_PB27A_IP1553_ARXINP                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_ARXINP */
#define PIO_PB27A_IP1553_ARXINP                    (_UINT32_(1) << 27) /**< IP1553 signal: IP1553_ARXINP */
#define PIN_PB26A_IP1553_ATXOUTN                   _UINT32_(58) /**< IP1553 signal: IP1553_ATXOUTN on PB26 mux A */
#define MUX_PB26A_IP1553_ATXOUTN                   _UINT32_(0)  /**< IP1553 signal line function value: IP1553_ATXOUTN */
#define PIO_PB26A_IP1553_ATXOUTN                   (_UINT32_(1) << 26) /**< IP1553 signal: IP1553_ATXOUTN */
#define PIN_PB25A_IP1553_ATXOUTP                   _UINT32_(57) /**< IP1553 signal: IP1553_ATXOUTP on PB25 mux A */
#define MUX_PB25A_IP1553_ATXOUTP                   _UINT32_(0)  /**< IP1553 signal line function value: IP1553_ATXOUTP */
#define PIO_PB25A_IP1553_ATXOUTP                   (_UINT32_(1) << 25) /**< IP1553 signal: IP1553_ATXOUTP */
#define PIN_PC3A_IP1553_BRXINN                     _UINT32_(67) /**< IP1553 signal: IP1553_BRXINN on PC3 mux A */
#define MUX_PC3A_IP1553_BRXINN                     _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BRXINN */
#define PIO_PC3A_IP1553_BRXINN                     (_UINT32_(1) << 3) /**< IP1553 signal: IP1553_BRXINN */
#define PIN_PD3A_IP1553_BRXINN                     _UINT32_(99) /**< IP1553 signal: IP1553_BRXINN on PD3 mux A */
#define MUX_PD3A_IP1553_BRXINN                     _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BRXINN */
#define PIO_PD3A_IP1553_BRXINN                     (_UINT32_(1) << 3) /**< IP1553 signal: IP1553_BRXINN */
#define PIN_PC2A_IP1553_BRXINP                     _UINT32_(66) /**< IP1553 signal: IP1553_BRXINP on PC2 mux A */
#define MUX_PC2A_IP1553_BRXINP                     _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BRXINP */
#define PIO_PC2A_IP1553_BRXINP                     (_UINT32_(1) << 2) /**< IP1553 signal: IP1553_BRXINP */
#define PIN_PD2A_IP1553_BRXINP                     _UINT32_(98) /**< IP1553 signal: IP1553_BRXINP on PD2 mux A */
#define MUX_PD2A_IP1553_BRXINP                     _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BRXINP */
#define PIO_PD2A_IP1553_BRXINP                     (_UINT32_(1) << 2) /**< IP1553 signal: IP1553_BRXINP */
#define PIN_PC1A_IP1553_BTXOUTN                    _UINT32_(65) /**< IP1553 signal: IP1553_BTXOUTN on PC1 mux A */
#define MUX_PC1A_IP1553_BTXOUTN                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BTXOUTN */
#define PIO_PC1A_IP1553_BTXOUTN                    (_UINT32_(1) << 1) /**< IP1553 signal: IP1553_BTXOUTN */
#define PIN_PD1A_IP1553_BTXOUTN                    _UINT32_(97) /**< IP1553 signal: IP1553_BTXOUTN on PD1 mux A */
#define MUX_PD1A_IP1553_BTXOUTN                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BTXOUTN */
#define PIO_PD1A_IP1553_BTXOUTN                    (_UINT32_(1) << 1) /**< IP1553 signal: IP1553_BTXOUTN */
#define PIN_PC0A_IP1553_BTXOUTP                    _UINT32_(64) /**< IP1553 signal: IP1553_BTXOUTP on PC0 mux A */
#define MUX_PC0A_IP1553_BTXOUTP                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BTXOUTP */
#define PIO_PC0A_IP1553_BTXOUTP                    (_UINT32_(1) << 0) /**< IP1553 signal: IP1553_BTXOUTP */
#define PIN_PD0A_IP1553_BTXOUTP                    _UINT32_(96) /**< IP1553 signal: IP1553_BTXOUTP on PD0 mux A */
#define MUX_PD0A_IP1553_BTXOUTP                    _UINT32_(0)  /**< IP1553 signal line function value: IP1553_BTXOUTP */
#define PIO_PD0A_IP1553_BTXOUTP                    (_UINT32_(1) << 0) /**< IP1553 signal: IP1553_BTXOUTP */
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PB8A_MCAN0_CANRX0                      _UINT32_(40) /**< MCAN0 signal: MCAN0_CANRX0 on PB8 mux A */
#define MUX_PB8A_MCAN0_CANRX0                      _UINT32_(0)  /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PB8A_MCAN0_CANRX0                      (_UINT32_(1) << 8) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PB7A_MCAN0_CANTX0                      _UINT32_(39) /**< MCAN0 signal: MCAN0_CANTX0 on PB7 mux A */
#define MUX_PB7A_MCAN0_CANTX0                      _UINT32_(0)  /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PB7A_MCAN0_CANTX0                      (_UINT32_(1) << 7) /**< MCAN0 signal: MCAN0_CANTX0 */
/* ========== PIO definition for MCAN1 peripheral ========== */
#define PIN_PB9A_MCAN1_CANRX1                      _UINT32_(41) /**< MCAN1 signal: MCAN1_CANRX1 on PB9 mux A */
#define MUX_PB9A_MCAN1_CANRX1                      _UINT32_(0)  /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PB9A_MCAN1_CANRX1                      (_UINT32_(1) << 9) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PC12A_MCAN1_CANRX1                     _UINT32_(76) /**< MCAN1 signal: MCAN1_CANRX1 on PC12 mux A */
#define MUX_PC12A_MCAN1_CANRX1                     _UINT32_(0)  /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PC12A_MCAN1_CANRX1                     (_UINT32_(1) << 12) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PB10A_MCAN1_CANTX1                     _UINT32_(42) /**< MCAN1 signal: MCAN1_CANTX1 on PB10 mux A */
#define MUX_PB10A_MCAN1_CANTX1                     _UINT32_(0)  /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PB10A_MCAN1_CANTX1                     (_UINT32_(1) << 10) /**< MCAN1 signal: MCAN1_CANTX1 */
#define PIN_PC13A_MCAN1_CANTX1                     _UINT32_(77) /**< MCAN1 signal: MCAN1_CANTX1 on PC13 mux A */
#define MUX_PC13A_MCAN1_CANTX1                     _UINT32_(0)  /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PC13A_MCAN1_CANTX1                     (_UINT32_(1) << 13) /**< MCAN1 signal: MCAN1_CANTX1 */
/* ========== PIO definition for PCC peripheral ========== */
#define PIN_PA20D_PCC_PCCCLK                       _UINT32_(20) /**< PCC signal: PCC_PCCCLK on PA20 mux D */
#define MUX_PA20D_PCC_PCCCLK                       _UINT32_(3)  /**< PCC signal line function value: PCC_PCCCLK */
#define PIO_PA20D_PCC_PCCCLK                       (_UINT32_(1) << 20) /**< PCC signal: PCC_PCCCLK */
#define PIN_PA0D_PCC_PCCDATA0                      _UINT32_(0)  /**< PCC signal: PCC_PCCDATA0 on PA0 mux D */
#define MUX_PA0D_PCC_PCCDATA0                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA0 */
#define PIO_PA0D_PCC_PCCDATA0                      (_UINT32_(1) << 0) /**< PCC signal: PCC_PCCDATA0 */
#define PIN_PA1D_PCC_PCCDATA1                      _UINT32_(1)  /**< PCC signal: PCC_PCCDATA1 on PA1 mux D */
#define MUX_PA1D_PCC_PCCDATA1                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA1 */
#define PIO_PA1D_PCC_PCCDATA1                      (_UINT32_(1) << 1) /**< PCC signal: PCC_PCCDATA1 */
#define PIN_PA2D_PCC_PCCDATA2                      _UINT32_(2)  /**< PCC signal: PCC_PCCDATA2 on PA2 mux D */
#define MUX_PA2D_PCC_PCCDATA2                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA2 */
#define PIO_PA2D_PCC_PCCDATA2                      (_UINT32_(1) << 2) /**< PCC signal: PCC_PCCDATA2 */
#define PIN_PA3D_PCC_PCCDATA3                      _UINT32_(3)  /**< PCC signal: PCC_PCCDATA3 on PA3 mux D */
#define MUX_PA3D_PCC_PCCDATA3                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA3 */
#define PIO_PA3D_PCC_PCCDATA3                      (_UINT32_(1) << 3) /**< PCC signal: PCC_PCCDATA3 */
#define PIN_PA4D_PCC_PCCDATA4                      _UINT32_(4)  /**< PCC signal: PCC_PCCDATA4 on PA4 mux D */
#define MUX_PA4D_PCC_PCCDATA4                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA4 */
#define PIO_PA4D_PCC_PCCDATA4                      (_UINT32_(1) << 4) /**< PCC signal: PCC_PCCDATA4 */
#define PIN_PA5D_PCC_PCCDATA5                      _UINT32_(5)  /**< PCC signal: PCC_PCCDATA5 on PA5 mux D */
#define MUX_PA5D_PCC_PCCDATA5                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA5 */
#define PIO_PA5D_PCC_PCCDATA5                      (_UINT32_(1) << 5) /**< PCC signal: PCC_PCCDATA5 */
#define PIN_PA6D_PCC_PCCDATA6                      _UINT32_(6)  /**< PCC signal: PCC_PCCDATA6 on PA6 mux D */
#define MUX_PA6D_PCC_PCCDATA6                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA6 */
#define PIO_PA6D_PCC_PCCDATA6                      (_UINT32_(1) << 6) /**< PCC signal: PCC_PCCDATA6 */
#define PIN_PA7D_PCC_PCCDATA7                      _UINT32_(7)  /**< PCC signal: PCC_PCCDATA7 on PA7 mux D */
#define MUX_PA7D_PCC_PCCDATA7                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA7 */
#define PIO_PA7D_PCC_PCCDATA7                      (_UINT32_(1) << 7) /**< PCC signal: PCC_PCCDATA7 */
#define PIN_PA8D_PCC_PCCDATA8                      _UINT32_(8)  /**< PCC signal: PCC_PCCDATA8 on PA8 mux D */
#define MUX_PA8D_PCC_PCCDATA8                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA8 */
#define PIO_PA8D_PCC_PCCDATA8                      (_UINT32_(1) << 8) /**< PCC signal: PCC_PCCDATA8 */
#define PIN_PA9D_PCC_PCCDATA9                      _UINT32_(9)  /**< PCC signal: PCC_PCCDATA9 on PA9 mux D */
#define MUX_PA9D_PCC_PCCDATA9                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA9 */
#define PIO_PA9D_PCC_PCCDATA9                      (_UINT32_(1) << 9) /**< PCC signal: PCC_PCCDATA9 */
#define PIN_PA10D_PCC_PCCDATA10                    _UINT32_(10) /**< PCC signal: PCC_PCCDATA10 on PA10 mux D */
#define MUX_PA10D_PCC_PCCDATA10                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA10 */
#define PIO_PA10D_PCC_PCCDATA10                    (_UINT32_(1) << 10) /**< PCC signal: PCC_PCCDATA10 */
#define PIN_PA11D_PCC_PCCDATA11                    _UINT32_(11) /**< PCC signal: PCC_PCCDATA11 on PA11 mux D */
#define MUX_PA11D_PCC_PCCDATA11                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA11 */
#define PIO_PA11D_PCC_PCCDATA11                    (_UINT32_(1) << 11) /**< PCC signal: PCC_PCCDATA11 */
#define PIN_PA12D_PCC_PCCDATA12                    _UINT32_(12) /**< PCC signal: PCC_PCCDATA12 on PA12 mux D */
#define MUX_PA12D_PCC_PCCDATA12                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA12 */
#define PIO_PA12D_PCC_PCCDATA12                    (_UINT32_(1) << 12) /**< PCC signal: PCC_PCCDATA12 */
#define PIN_PA13D_PCC_PCCDATA13                    _UINT32_(13) /**< PCC signal: PCC_PCCDATA13 on PA13 mux D */
#define MUX_PA13D_PCC_PCCDATA13                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA13 */
#define PIO_PA13D_PCC_PCCDATA13                    (_UINT32_(1) << 13) /**< PCC signal: PCC_PCCDATA13 */
#define PIN_PA14D_PCC_PCCDATA14                    _UINT32_(14) /**< PCC signal: PCC_PCCDATA14 on PA14 mux D */
#define MUX_PA14D_PCC_PCCDATA14                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA14 */
#define PIO_PA14D_PCC_PCCDATA14                    (_UINT32_(1) << 14) /**< PCC signal: PCC_PCCDATA14 */
#define PIN_PA15D_PCC_PCCDATA15                    _UINT32_(15) /**< PCC signal: PCC_PCCDATA15 on PA15 mux D */
#define MUX_PA15D_PCC_PCCDATA15                    _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDATA15 */
#define PIO_PA15D_PCC_PCCDATA15                    (_UINT32_(1) << 15) /**< PCC signal: PCC_PCCDATA15 */
#define PIN_PA27D_PCC_PCCDEN1                      _UINT32_(27) /**< PCC signal: PCC_PCCDEN1 on PA27 mux D */
#define MUX_PA27D_PCC_PCCDEN1                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDEN1 */
#define PIO_PA27D_PCC_PCCDEN1                      (_UINT32_(1) << 27) /**< PCC signal: PCC_PCCDEN1 */
#define PIN_PA25D_PCC_PCCDEN2                      _UINT32_(25) /**< PCC signal: PCC_PCCDEN2 on PA25 mux D */
#define MUX_PA25D_PCC_PCCDEN2                      _UINT32_(3)  /**< PCC signal line function value: PCC_PCCDEN2 */
#define PIO_PA25D_PCC_PCCDEN2                      (_UINT32_(1) << 25) /**< PCC signal: PCC_PCCDEN2 */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA19A_PMC_PCK0                         _UINT32_(19) /**< PMC signal: PMC_PCK0 on PA19 mux A */
#define MUX_PA19A_PMC_PCK0                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PA19A_PMC_PCK0                         (_UINT32_(1) << 19) /**< PMC signal: PMC_PCK0 */
#define PIN_PA30A_PMC_PCK1                         _UINT32_(30) /**< PMC signal: PMC_PCK1 on PA30 mux A */
#define MUX_PA30A_PMC_PCK1                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PA30A_PMC_PCK1                         (_UINT32_(1) << 30) /**< PMC signal: PMC_PCK1 */
#define PIN_PA31A_PMC_PCK1                         _UINT32_(31) /**< PMC signal: PMC_PCK1 on PA31 mux A */
#define MUX_PA31A_PMC_PCK1                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PA31A_PMC_PCK1                         (_UINT32_(1) << 31) /**< PMC signal: PMC_PCK1 */
#define PIN_PD8A_PMC_PCK2                          _UINT32_(104) /**< PMC signal: PMC_PCK2 on PD8 mux A */
#define MUX_PD8A_PMC_PCK2                          _UINT32_(0)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PD8A_PMC_PCK2                          (_UINT32_(1) << 8) /**< PMC signal: PMC_PCK2 */
/* ========== PIO definition for PWM0 peripheral ========== */
#define PIN_PA19B_PWM0_PWMC0_PWMEXTRG0             _UINT32_(19) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG0 on PA19 mux B */
#define MUX_PA19B_PWM0_PWMC0_PWMEXTRG0             _UINT32_(1)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMEXTRG0 */
#define PIO_PA19B_PWM0_PWMC0_PWMEXTRG0             (_UINT32_(1) << 19) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG0 */
#define PIN_PB1B_PWM0_PWMC0_PWMEXTRG1              _UINT32_(33) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG1 on PB1 mux B */
#define MUX_PB1B_PWM0_PWMC0_PWMEXTRG1              _UINT32_(1)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMEXTRG1 */
#define PIO_PB1B_PWM0_PWMC0_PWMEXTRG1              (_UINT32_(1) << 1) /**< PWM0 signal: PWM0_PWMC0_PWMEXTRG1 */
#define PIN_PA29D_PWM0_PWMC0_PWMFI0                _UINT32_(29) /**< PWM0 signal: PWM0_PWMC0_PWMFI0 on PA29 mux D */
#define MUX_PA29D_PWM0_PWMC0_PWMFI0                _UINT32_(3)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI0 */
#define PIO_PA29D_PWM0_PWMC0_PWMFI0                (_UINT32_(1) << 29) /**< PWM0 signal: PWM0_PWMC0_PWMFI0 */
#define PIN_PA30D_PWM0_PWMC0_PWMFI1                _UINT32_(30) /**< PWM0 signal: PWM0_PWMC0_PWMFI1 on PA30 mux D */
