Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/pio/samrh707f18a.h
#define MUX_PA30D_PWM0_PWMC0_PWMFI1                _UINT32_(3)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI1 */
#define PIO_PA30D_PWM0_PWMC0_PWMFI1                (_UINT32_(1) << 30) /**< PWM0 signal: PWM0_PWMC0_PWMFI1 */
#define PIN_PA16C_PWM0_PWMC0_PWMFI2                _UINT32_(16) /**< PWM0 signal: PWM0_PWMC0_PWMFI2 on PA16 mux C */
#define MUX_PA16C_PWM0_PWMC0_PWMFI2                _UINT32_(2)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMFI2 */
#define PIO_PA16C_PWM0_PWMC0_PWMFI2                (_UINT32_(1) << 16) /**< PWM0 signal: PWM0_PWMC0_PWMFI2 */
#define PIN_PB11A_PWM0_PWMC0_PWMH0                 _UINT32_(43) /**< PWM0 signal: PWM0_PWMC0_PWMH0 on PB11 mux A */
#define MUX_PB11A_PWM0_PWMC0_PWMH0                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMH0 */
#define PIO_PB11A_PWM0_PWMC0_PWMH0                 (_UINT32_(1) << 11) /**< PWM0 signal: PWM0_PWMC0_PWMH0 */
#define PIN_PB13A_PWM0_PWMC0_PWMH1                 _UINT32_(45) /**< PWM0 signal: PWM0_PWMC0_PWMH1 on PB13 mux A */
#define MUX_PB13A_PWM0_PWMC0_PWMH1                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMH1 */
#define PIO_PB13A_PWM0_PWMC0_PWMH1                 (_UINT32_(1) << 13) /**< PWM0 signal: PWM0_PWMC0_PWMH1 */
#define PIN_PB15A_PWM0_PWMC0_PWMH2                 _UINT32_(47) /**< PWM0 signal: PWM0_PWMC0_PWMH2 on PB15 mux A */
#define MUX_PB15A_PWM0_PWMC0_PWMH2                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMH2 */
#define PIO_PB15A_PWM0_PWMC0_PWMH2                 (_UINT32_(1) << 15) /**< PWM0 signal: PWM0_PWMC0_PWMH2 */
#define PIN_PB17A_PWM0_PWMC0_PWMH3                 _UINT32_(49) /**< PWM0 signal: PWM0_PWMC0_PWMH3 on PB17 mux A */
#define MUX_PB17A_PWM0_PWMC0_PWMH3                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWMH3 */
#define PIO_PB17A_PWM0_PWMC0_PWMH3                 (_UINT32_(1) << 17) /**< PWM0 signal: PWM0_PWMC0_PWMH3 */
#define PIN_PB12A_PWM0_PWMC0_PWML0                 _UINT32_(44) /**< PWM0 signal: PWM0_PWMC0_PWML0 on PB12 mux A */
#define MUX_PB12A_PWM0_PWMC0_PWML0                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWML0 */
#define PIO_PB12A_PWM0_PWMC0_PWML0                 (_UINT32_(1) << 12) /**< PWM0 signal: PWM0_PWMC0_PWML0 */
#define PIN_PB14A_PWM0_PWMC0_PWML1                 _UINT32_(46) /**< PWM0 signal: PWM0_PWMC0_PWML1 on PB14 mux A */
#define MUX_PB14A_PWM0_PWMC0_PWML1                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWML1 */
#define PIO_PB14A_PWM0_PWMC0_PWML1                 (_UINT32_(1) << 14) /**< PWM0 signal: PWM0_PWMC0_PWML1 */
#define PIN_PB16A_PWM0_PWMC0_PWML2                 _UINT32_(48) /**< PWM0 signal: PWM0_PWMC0_PWML2 on PB16 mux A */
#define MUX_PB16A_PWM0_PWMC0_PWML2                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWML2 */
#define PIO_PB16A_PWM0_PWMC0_PWML2                 (_UINT32_(1) << 16) /**< PWM0 signal: PWM0_PWMC0_PWML2 */
#define PIN_PB18A_PWM0_PWMC0_PWML3                 _UINT32_(50) /**< PWM0 signal: PWM0_PWMC0_PWML3 on PB18 mux A */
#define MUX_PB18A_PWM0_PWMC0_PWML3                 _UINT32_(0)  /**< PWM0 signal line function value: PWM0_PWMC0_PWML3 */
#define PIO_PB18A_PWM0_PWMC0_PWML3                 (_UINT32_(1) << 18) /**< PWM0 signal: PWM0_PWMC0_PWML3 */
/* ========== PIO definition for PWM1 peripheral ========== */
#define PIN_PD5A_PWM1_PWMC1_PWMEXTRG0              _UINT32_(101) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG0 on PD5 mux A */
#define MUX_PD5A_PWM1_PWMC1_PWMEXTRG0              _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMEXTRG0 */
#define PIO_PD5A_PWM1_PWMC1_PWMEXTRG0              (_UINT32_(1) << 5) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG0 */
#define PIN_PC19C_PWM1_PWMC1_PWMEXTRG1             _UINT32_(83) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG1 on PC19 mux C */
#define MUX_PC19C_PWM1_PWMC1_PWMEXTRG1             _UINT32_(2)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMEXTRG1 */
#define PIO_PC19C_PWM1_PWMC1_PWMEXTRG1             (_UINT32_(1) << 19) /**< PWM1 signal: PWM1_PWMC1_PWMEXTRG1 */
#define PIN_PD4A_PWM1_PWMC1_PWMFI0                 _UINT32_(100) /**< PWM1 signal: PWM1_PWMC1_PWMFI0 on PD4 mux A */
#define MUX_PD4A_PWM1_PWMC1_PWMFI0                 _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI0 */
#define PIO_PD4A_PWM1_PWMC1_PWMFI0                 (_UINT32_(1) << 4) /**< PWM1 signal: PWM1_PWMC1_PWMFI0 */
#define PIN_PC16C_PWM1_PWMC1_PWMFI1                _UINT32_(80) /**< PWM1 signal: PWM1_PWMC1_PWMFI1 on PC16 mux C */
#define MUX_PC16C_PWM1_PWMC1_PWMFI1                _UINT32_(2)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI1 */
#define PIO_PC16C_PWM1_PWMC1_PWMFI1                (_UINT32_(1) << 16) /**< PWM1 signal: PWM1_PWMC1_PWMFI1 */
#define PIN_PC18C_PWM1_PWMC1_PWMFI2                _UINT32_(82) /**< PWM1 signal: PWM1_PWMC1_PWMFI2 on PC18 mux C */
#define MUX_PC18C_PWM1_PWMC1_PWMFI2                _UINT32_(2)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMFI2 */
#define PIO_PC18C_PWM1_PWMC1_PWMFI2                (_UINT32_(1) << 18) /**< PWM1 signal: PWM1_PWMC1_PWMFI2 */
#define PIN_PC4A_PWM1_PWMC1_PWMH0                  _UINT32_(68) /**< PWM1 signal: PWM1_PWMC1_PWMH0 on PC4 mux A */
#define MUX_PC4A_PWM1_PWMC1_PWMH0                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMH0 */
#define PIO_PC4A_PWM1_PWMC1_PWMH0                  (_UINT32_(1) << 4) /**< PWM1 signal: PWM1_PWMC1_PWMH0 */
#define PIN_PC6A_PWM1_PWMC1_PWMH1                  _UINT32_(70) /**< PWM1 signal: PWM1_PWMC1_PWMH1 on PC6 mux A */
#define MUX_PC6A_PWM1_PWMC1_PWMH1                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMH1 */
#define PIO_PC6A_PWM1_PWMC1_PWMH1                  (_UINT32_(1) << 6) /**< PWM1 signal: PWM1_PWMC1_PWMH1 */
#define PIN_PC8A_PWM1_PWMC1_PWMH2                  _UINT32_(72) /**< PWM1 signal: PWM1_PWMC1_PWMH2 on PC8 mux A */
#define MUX_PC8A_PWM1_PWMC1_PWMH2                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMH2 */
#define PIO_PC8A_PWM1_PWMC1_PWMH2                  (_UINT32_(1) << 8) /**< PWM1 signal: PWM1_PWMC1_PWMH2 */
#define PIN_PC10A_PWM1_PWMC1_PWMH3                 _UINT32_(74) /**< PWM1 signal: PWM1_PWMC1_PWMH3 on PC10 mux A */
#define MUX_PC10A_PWM1_PWMC1_PWMH3                 _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWMH3 */
#define PIO_PC10A_PWM1_PWMC1_PWMH3                 (_UINT32_(1) << 10) /**< PWM1 signal: PWM1_PWMC1_PWMH3 */
#define PIN_PC5A_PWM1_PWMC1_PWML0                  _UINT32_(69) /**< PWM1 signal: PWM1_PWMC1_PWML0 on PC5 mux A */
#define MUX_PC5A_PWM1_PWMC1_PWML0                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWML0 */
#define PIO_PC5A_PWM1_PWMC1_PWML0                  (_UINT32_(1) << 5) /**< PWM1 signal: PWM1_PWMC1_PWML0 */
#define PIN_PC7A_PWM1_PWMC1_PWML1                  _UINT32_(71) /**< PWM1 signal: PWM1_PWMC1_PWML1 on PC7 mux A */
#define MUX_PC7A_PWM1_PWMC1_PWML1                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWML1 */
#define PIO_PC7A_PWM1_PWMC1_PWML1                  (_UINT32_(1) << 7) /**< PWM1 signal: PWM1_PWMC1_PWML1 */
#define PIN_PC9A_PWM1_PWMC1_PWML2                  _UINT32_(73) /**< PWM1 signal: PWM1_PWMC1_PWML2 on PC9 mux A */
#define MUX_PC9A_PWM1_PWMC1_PWML2                  _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWML2 */
#define PIO_PC9A_PWM1_PWMC1_PWML2                  (_UINT32_(1) << 9) /**< PWM1 signal: PWM1_PWMC1_PWML2 */
#define PIN_PC11A_PWM1_PWMC1_PWML3                 _UINT32_(75) /**< PWM1 signal: PWM1_PWMC1_PWML3 on PC11 mux A */
#define MUX_PC11A_PWM1_PWMC1_PWML3                 _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWMC1_PWML3 */
#define PIO_PC11A_PWM1_PWMC1_PWML3                 (_UINT32_(1) << 11) /**< PWM1 signal: PWM1_PWMC1_PWML3 */
/* ========== PIO definition for RTC peripheral ========== */
#define PIN_PB2A_RTC_RTCOUT0                       _UINT32_(34) /**< RTC signal: RTC_RTCOUT0 on PB2 mux A */
#define MUX_PB2A_RTC_RTCOUT0                       _UINT32_(0)  /**< RTC signal line function value: RTC_RTCOUT0 */
#define PIO_PB2A_RTC_RTCOUT0                       (_UINT32_(1) << 2) /**< RTC signal: RTC_RTCOUT0 */
#define PIN_PD6A_RTC_RTCOUT1                       _UINT32_(102) /**< RTC signal: RTC_RTCOUT1 on PD6 mux A */
#define MUX_PD6A_RTC_RTCOUT1                       _UINT32_(0)  /**< RTC signal line function value: RTC_RTCOUT1 */
#define PIO_PD6A_RTC_RTCOUT1                       (_UINT32_(1) << 6) /**< RTC signal: RTC_RTCOUT1 */
#define PIN_PD9B_RTC_RTCOUT1                       _UINT32_(105) /**< RTC signal: RTC_RTCOUT1 on PD9 mux B */
#define MUX_PD9B_RTC_RTCOUT1                       _UINT32_(1)  /**< RTC signal line function value: RTC_RTCOUT1 */
#define PIO_PD9B_RTC_RTCOUT1                       (_UINT32_(1) << 9) /**< RTC signal: RTC_RTCOUT1 */
/* ========== PIO definition for SPW peripheral ========== */
#define PIN_PD11A_SPW_SPWDINN0                     _UINT32_(107) /**< SPW signal: SPW_SPWDINN0 on PD11 mux A */
#define MUX_PD11A_SPW_SPWDINN0                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDINN0 */
#define PIO_PD11A_SPW_SPWDINN0                     (_UINT32_(1) << 11) /**< SPW signal: SPW_SPWDINN0 */
#define PIN_PD19A_SPW_SPWDINN1                     _UINT32_(115) /**< SPW signal: SPW_SPWDINN1 on PD19 mux A */
#define MUX_PD19A_SPW_SPWDINN1                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDINN1 */
#define PIO_PD19A_SPW_SPWDINN1                     (_UINT32_(1) << 19) /**< SPW signal: SPW_SPWDINN1 */
#define PIN_PD10A_SPW_SPWDINP0                     _UINT32_(106) /**< SPW signal: SPW_SPWDINP0 on PD10 mux A */
#define MUX_PD10A_SPW_SPWDINP0                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDINP0 */
#define PIO_PD10A_SPW_SPWDINP0                     (_UINT32_(1) << 10) /**< SPW signal: SPW_SPWDINP0 */
#define PIN_PD18A_SPW_SPWDINP1                     _UINT32_(114) /**< SPW signal: SPW_SPWDINP1 on PD18 mux A */
#define MUX_PD18A_SPW_SPWDINP1                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDINP1 */
#define PIO_PD18A_SPW_SPWDINP1                     (_UINT32_(1) << 18) /**< SPW signal: SPW_SPWDINP1 */
#define PIN_PD13A_SPW_SPWDOUTN0                    _UINT32_(109) /**< SPW signal: SPW_SPWDOUTN0 on PD13 mux A */
#define MUX_PD13A_SPW_SPWDOUTN0                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDOUTN0 */
#define PIO_PD13A_SPW_SPWDOUTN0                    (_UINT32_(1) << 13) /**< SPW signal: SPW_SPWDOUTN0 */
#define PIN_PD21A_SPW_SPWDOUTN1                    _UINT32_(117) /**< SPW signal: SPW_SPWDOUTN1 on PD21 mux A */
#define MUX_PD21A_SPW_SPWDOUTN1                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDOUTN1 */
#define PIO_PD21A_SPW_SPWDOUTN1                    (_UINT32_(1) << 21) /**< SPW signal: SPW_SPWDOUTN1 */
#define PIN_PD12A_SPW_SPWDOUTP0                    _UINT32_(108) /**< SPW signal: SPW_SPWDOUTP0 on PD12 mux A */
#define MUX_PD12A_SPW_SPWDOUTP0                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDOUTP0 */
#define PIO_PD12A_SPW_SPWDOUTP0                    (_UINT32_(1) << 12) /**< SPW signal: SPW_SPWDOUTP0 */
#define PIN_PD20A_SPW_SPWDOUTP1                    _UINT32_(116) /**< SPW signal: SPW_SPWDOUTP1 on PD20 mux A */
#define MUX_PD20A_SPW_SPWDOUTP1                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWDOUTP1 */
#define PIO_PD20A_SPW_SPWDOUTP1                    (_UINT32_(1) << 20) /**< SPW signal: SPW_SPWDOUTP1 */
#define PIN_PD17A_SPW_SPWSINN0                     _UINT32_(113) /**< SPW signal: SPW_SPWSINN0 on PD17 mux A */
#define MUX_PD17A_SPW_SPWSINN0                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSINN0 */
#define PIO_PD17A_SPW_SPWSINN0                     (_UINT32_(1) << 17) /**< SPW signal: SPW_SPWSINN0 */
#define PIN_PD25A_SPW_SPWSINN1                     _UINT32_(121) /**< SPW signal: SPW_SPWSINN1 on PD25 mux A */
#define MUX_PD25A_SPW_SPWSINN1                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSINN1 */
#define PIO_PD25A_SPW_SPWSINN1                     (_UINT32_(1) << 25) /**< SPW signal: SPW_SPWSINN1 */
#define PIN_PD16A_SPW_SPWSINP0                     _UINT32_(112) /**< SPW signal: SPW_SPWSINP0 on PD16 mux A */
#define MUX_PD16A_SPW_SPWSINP0                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSINP0 */
#define PIO_PD16A_SPW_SPWSINP0                     (_UINT32_(1) << 16) /**< SPW signal: SPW_SPWSINP0 */
#define PIN_PD24A_SPW_SPWSINP1                     _UINT32_(120) /**< SPW signal: SPW_SPWSINP1 on PD24 mux A */
#define MUX_PD24A_SPW_SPWSINP1                     _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSINP1 */
#define PIO_PD24A_SPW_SPWSINP1                     (_UINT32_(1) << 24) /**< SPW signal: SPW_SPWSINP1 */
#define PIN_PD15A_SPW_SPWSOUTN0                    _UINT32_(111) /**< SPW signal: SPW_SPWSOUTN0 on PD15 mux A */
#define MUX_PD15A_SPW_SPWSOUTN0                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSOUTN0 */
#define PIO_PD15A_SPW_SPWSOUTN0                    (_UINT32_(1) << 15) /**< SPW signal: SPW_SPWSOUTN0 */
#define PIN_PD23A_SPW_SPWSOUTN1                    _UINT32_(119) /**< SPW signal: SPW_SPWSOUTN1 on PD23 mux A */
#define MUX_PD23A_SPW_SPWSOUTN1                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSOUTN1 */
#define PIO_PD23A_SPW_SPWSOUTN1                    (_UINT32_(1) << 23) /**< SPW signal: SPW_SPWSOUTN1 */
#define PIN_PD14A_SPW_SPWSOUTP0                    _UINT32_(110) /**< SPW signal: SPW_SPWSOUTP0 on PD14 mux A */
#define MUX_PD14A_SPW_SPWSOUTP0                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSOUTP0 */
#define PIO_PD14A_SPW_SPWSOUTP0                    (_UINT32_(1) << 14) /**< SPW signal: SPW_SPWSOUTP0 */
#define PIN_PD22A_SPW_SPWSOUTP1                    _UINT32_(118) /**< SPW signal: SPW_SPWSOUTP1 on PD22 mux A */
#define MUX_PD22A_SPW_SPWSOUTP1                    _UINT32_(0)  /**< SPW signal line function value: SPW_SPWSOUTP1 */
#define PIO_PD22A_SPW_SPWSOUTP1                    (_UINT32_(1) << 22) /**< SPW signal: SPW_SPWSOUTP1 */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PB18C_TC0_TCLK0                        _UINT32_(50) /**< TC0 signal: TC0_TCLK0 on PB18 mux C */
#define MUX_PB18C_TC0_TCLK0                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PB18C_TC0_TCLK0                        (_UINT32_(1) << 18) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PA20C_TC0_TCLK1                        _UINT32_(20) /**< TC0 signal: TC0_TCLK1 on PA20 mux C */
#define MUX_PA20C_TC0_TCLK1                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA20C_TC0_TCLK1                        (_UINT32_(1) << 20) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PA25C_TC0_TCLK2                        _UINT32_(25) /**< TC0 signal: TC0_TCLK2 on PA25 mux C */
#define MUX_PA25C_TC0_TCLK2                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PA25C_TC0_TCLK2                        (_UINT32_(1) << 25) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PB19C_TC0_TCLK2                        _UINT32_(51) /**< TC0 signal: TC0_TCLK2 on PB19 mux C */
#define MUX_PB19C_TC0_TCLK2                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PB19C_TC0_TCLK2                        (_UINT32_(1) << 19) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA29C_TC0_TIOA0                        _UINT32_(29) /**< TC0 signal: TC0_TIOA0 on PA29 mux C */
#define MUX_PA29C_TC0_TIOA0                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA29C_TC0_TIOA0                        (_UINT32_(1) << 29) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA27C_TC0_TIOA1                        _UINT32_(27) /**< TC0 signal: TC0_TIOA1 on PA27 mux C */
#define MUX_PA27C_TC0_TIOA1                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA27C_TC0_TIOA1                        (_UINT32_(1) << 27) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PA28C_TC0_TIOA2                        _UINT32_(28) /**< TC0 signal: TC0_TIOA2 on PA28 mux C */
#define MUX_PA28C_TC0_TIOA2                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PA28C_TC0_TIOA2                        (_UINT32_(1) << 28) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PB0C_TC0_TIOA2                         _UINT32_(32) /**< TC0 signal: TC0_TIOA2 on PB0 mux C */
#define MUX_PB0C_TC0_TIOA2                         _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PB0C_TC0_TIOA2                         (_UINT32_(1) << 0) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA30C_TC0_TIOB0                        _UINT32_(30) /**< TC0 signal: TC0_TIOB0 on PA30 mux C */
#define MUX_PA30C_TC0_TIOB0                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA30C_TC0_TIOB0                        (_UINT32_(1) << 30) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PB17C_TC0_TIOB1                        _UINT32_(49) /**< TC0 signal: TC0_TIOB1 on PB17 mux C */
#define MUX_PB17C_TC0_TIOB1                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PB17C_TC0_TIOB1                        (_UINT32_(1) << 17) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PA26C_TC0_TIOB2                        _UINT32_(26) /**< TC0 signal: TC0_TIOB2 on PA26 mux C */
#define MUX_PA26C_TC0_TIOB2                        _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA26C_TC0_TIOB2                        (_UINT32_(1) << 26) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PB11C_TC1_TCLK3                        _UINT32_(43) /**< TC1 signal: TC1_TCLK3 on PB11 mux C */
#define MUX_PB11C_TC1_TCLK3                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PB11C_TC1_TCLK3                        (_UINT32_(1) << 11) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PB12C_TC1_TCLK4                        _UINT32_(44) /**< TC1 signal: TC1_TCLK4 on PB12 mux C */
#define MUX_PB12C_TC1_TCLK4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PB12C_TC1_TCLK4                        (_UINT32_(1) << 12) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PB1C_TC1_TCLK5                         _UINT32_(33) /**< TC1 signal: TC1_TCLK5 on PB1 mux C */
#define MUX_PB1C_TC1_TCLK5                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PB1C_TC1_TCLK5                         (_UINT32_(1) << 1) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PB7C_TC1_TIOA3                         _UINT32_(39) /**< TC1 signal: TC1_TIOA3 on PB7 mux C */
#define MUX_PB7C_TC1_TIOA3                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PB7C_TC1_TIOA3                         (_UINT32_(1) << 7) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PB13C_TC1_TIOA4                        _UINT32_(45) /**< TC1 signal: TC1_TIOA4 on PB13 mux C */
#define MUX_PB13C_TC1_TIOA4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA4 */
#define PIO_PB13C_TC1_TIOA4                        (_UINT32_(1) << 13) /**< TC1 signal: TC1_TIOA4 */
#define PIN_PB16C_TC1_TIOA5                        _UINT32_(48) /**< TC1 signal: TC1_TIOA5 on PB16 mux C */
#define MUX_PB16C_TC1_TIOA5                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PB16C_TC1_TIOA5                        (_UINT32_(1) << 16) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PB8C_TC1_TIOB3                         _UINT32_(40) /**< TC1 signal: TC1_TIOB3 on PB8 mux C */
#define MUX_PB8C_TC1_TIOB3                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB3 */
#define PIO_PB8C_TC1_TIOB3                         (_UINT32_(1) << 8) /**< TC1 signal: TC1_TIOB3 */
#define PIN_PB14C_TC1_TIOB4                        _UINT32_(46) /**< TC1 signal: TC1_TIOB4 on PB14 mux C */
#define MUX_PB14C_TC1_TIOB4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB4 */
#define PIO_PB14C_TC1_TIOB4                        (_UINT32_(1) << 14) /**< TC1 signal: TC1_TIOB4 */
#define PIN_PB15C_TC1_TIOB5                        _UINT32_(47) /**< TC1 signal: TC1_TIOB5 on PB15 mux C */
#define MUX_PB15C_TC1_TIOB5                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PB15C_TC1_TIOB5                        (_UINT32_(1) << 15) /**< TC1 signal: TC1_TIOB5 */
/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PC11C_TC2_TCLK6                        _UINT32_(75) /**< TC2 signal: TC2_TCLK6 on PC11 mux C */
#define MUX_PC11C_TC2_TCLK6                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TCLK6 */
#define PIO_PC11C_TC2_TCLK6                        (_UINT32_(1) << 11) /**< TC2 signal: TC2_TCLK6 */
#define PIN_PC10C_TC2_TCLK7                        _UINT32_(74) /**< TC2 signal: TC2_TCLK7 on PC10 mux C */
#define MUX_PC10C_TC2_TCLK7                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TCLK7 */
#define PIO_PC10C_TC2_TCLK7                        (_UINT32_(1) << 10) /**< TC2 signal: TC2_TCLK7 */
#define PIN_PC26C_TC2_TCLK8                        _UINT32_(90) /**< TC2 signal: TC2_TCLK8 on PC26 mux C */
#define MUX_PC26C_TC2_TCLK8                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TCLK8 */
#define PIO_PC26C_TC2_TCLK8                        (_UINT32_(1) << 26) /**< TC2 signal: TC2_TCLK8 */
#define PIN_PC8C_TC2_TIOA6                         _UINT32_(72) /**< TC2 signal: TC2_TIOA6 on PC8 mux C */
#define MUX_PC8C_TC2_TIOA6                         _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOA6 */
#define PIO_PC8C_TC2_TIOA6                         (_UINT32_(1) << 8) /**< TC2 signal: TC2_TIOA6 */
#define PIN_PC14C_TC2_TIOA7                        _UINT32_(78) /**< TC2 signal: TC2_TIOA7 on PC14 mux C */
#define MUX_PC14C_TC2_TIOA7                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOA7 */
#define PIO_PC14C_TC2_TIOA7                        (_UINT32_(1) << 14) /**< TC2 signal: TC2_TIOA7 */
#define PIN_PC27C_TC2_TIOA8                        _UINT32_(91) /**< TC2 signal: TC2_TIOA8 on PC27 mux C */
#define MUX_PC27C_TC2_TIOA8                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOA8 */
#define PIO_PC27C_TC2_TIOA8                        (_UINT32_(1) << 27) /**< TC2 signal: TC2_TIOA8 */
#define PIN_PC9C_TC2_TIOB6                         _UINT32_(73) /**< TC2 signal: TC2_TIOB6 on PC9 mux C */
#define MUX_PC9C_TC2_TIOB6                         _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOB6 */
#define PIO_PC9C_TC2_TIOB6                         (_UINT32_(1) << 9) /**< TC2 signal: TC2_TIOB6 */
#define PIN_PC15C_TC2_TIOB7                        _UINT32_(79) /**< TC2 signal: TC2_TIOB7 on PC15 mux C */
#define MUX_PC15C_TC2_TIOB7                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOB7 */
#define PIO_PC15C_TC2_TIOB7                        (_UINT32_(1) << 15) /**< TC2 signal: TC2_TIOB7 */
#define PIN_PC28C_TC2_TIOB8                        _UINT32_(92) /**< TC2 signal: TC2_TIOB8 on PC28 mux C */
