Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/pio/samrh707f18a.h
#define MUX_PC28C_TC2_TIOB8                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOB8 */
#define PIO_PC28C_TC2_TIOB8                        (_UINT32_(1) << 28) /**< TC2 signal: TC2_TIOB8 */
/* ========== PIO definition for ICE peripheral ========== */
#define PIN_PB24A_ICE_SWDCLK                       _UINT32_(56) /**< ICE signal: ICE_SWDCLK on PB24 mux A */
#define MUX_PB24A_ICE_SWDCLK                       _UINT32_(0)  /**< ICE signal line function value: ICE_SWDCLK */
#define PIO_PB24A_ICE_SWDCLK                       (_UINT32_(1) << 24) /**< ICE signal: ICE_SWDCLK */
#define PIN_PB23A_ICE_SWDIO                        _UINT32_(55) /**< ICE signal: ICE_SWDIO on PB23 mux A */
#define MUX_PB23A_ICE_SWDIO                        _UINT32_(0)  /**< ICE signal line function value: ICE_SWDIO */
#define PIO_PB23A_ICE_SWDIO                        (_UINT32_(1) << 23) /**< ICE signal: ICE_SWDIO */
#define PIN_PB24A_ICE_TCK                          _UINT32_(56) /**< ICE signal: ICE_TCK on PB24 mux A */
#define MUX_PB24A_ICE_TCK                          _UINT32_(0)  /**< ICE signal line function value: ICE_TCK */
#define PIO_PB24A_ICE_TCK                          (_UINT32_(1) << 24) /**< ICE signal: ICE_TCK */
#define PIN_PA26E_ICE_TDI                          _UINT32_(26) /**< ICE signal: ICE_TDI on PA26 mux E */
#define MUX_PA26E_ICE_TDI                          _UINT32_(4)  /**< ICE signal line function value: ICE_TDI */
#define PIO_PA26E_ICE_TDI                          (_UINT32_(1) << 26) /**< ICE signal: ICE_TDI */
#define PIN_PA25E_ICE_TDO                          _UINT32_(25) /**< ICE signal: ICE_TDO on PA25 mux E */
#define MUX_PA25E_ICE_TDO                          _UINT32_(4)  /**< ICE signal line function value: ICE_TDO */
#define PIO_PA25E_ICE_TDO                          (_UINT32_(1) << 25) /**< ICE signal: ICE_TDO */
#define PIN_PB23A_ICE_TMS                          _UINT32_(55) /**< ICE signal: ICE_TMS on PB23 mux A */
#define MUX_PB23A_ICE_TMS                          _UINT32_(0)  /**< ICE signal line function value: ICE_TMS */
#define PIO_PB23A_ICE_TMS                          (_UINT32_(1) << 23) /**< ICE signal: ICE_TMS */
#define PIN_PA25E_ICE_TRACESWO                     _UINT32_(25) /**< ICE signal: ICE_TRACESWO on PA25 mux E */
#define MUX_PA25E_ICE_TRACESWO                     _UINT32_(4)  /**< ICE signal line function value: ICE_TRACESWO */
#define PIO_PA25E_ICE_TRACESWO                     (_UINT32_(1) << 25) /**< ICE signal: ICE_TRACESWO */
/* ========== PIO definition for TPIU peripheral ========== */
#define PIN_PA20E_TPIU_TRACECLK                    _UINT32_(20) /**< TPIU signal: TPIU_TRACECLK on PA20 mux E */
#define MUX_PA20E_TPIU_TRACECLK                    _UINT32_(4)  /**< TPIU signal line function value: TPIU_TRACECLK */
#define PIO_PA20E_TPIU_TRACECLK                    (_UINT32_(1) << 20) /**< TPIU signal: TPIU_TRACECLK */
#define PIN_PA29E_TPIU_TRACED0                     _UINT32_(29) /**< TPIU signal: TPIU_TRACED0 on PA29 mux E */
#define MUX_PA29E_TPIU_TRACED0                     _UINT32_(4)  /**< TPIU signal line function value: TPIU_TRACED0 */
#define PIO_PA29E_TPIU_TRACED0                     (_UINT32_(1) << 29) /**< TPIU signal: TPIU_TRACED0 */
#define PIN_PA30E_TPIU_TRACED1                     _UINT32_(30) /**< TPIU signal: TPIU_TRACED1 on PA30 mux E */
#define MUX_PA30E_TPIU_TRACED1                     _UINT32_(4)  /**< TPIU signal line function value: TPIU_TRACED1 */
#define PIO_PA30E_TPIU_TRACED1                     (_UINT32_(1) << 30) /**< TPIU signal: TPIU_TRACED1 */
#define PIN_PA28E_TPIU_TRACED2                     _UINT32_(28) /**< TPIU signal: TPIU_TRACED2 on PA28 mux E */
#define MUX_PA28E_TPIU_TRACED2                     _UINT32_(4)  /**< TPIU signal line function value: TPIU_TRACED2 */
#define PIO_PA28E_TPIU_TRACED2                     (_UINT32_(1) << 28) /**< TPIU signal: TPIU_TRACED2 */
#define PIN_PA27E_TPIU_TRACED3                     _UINT32_(27) /**< TPIU signal: TPIU_TRACED3 on PA27 mux E */
#define MUX_PA27E_TPIU_TRACED3                     _UINT32_(4)  /**< TPIU signal line function value: TPIU_TRACED3 */
#define PIO_PA27E_TPIU_TRACED3                     (_UINT32_(1) << 27) /**< TPIU signal: TPIU_TRACED3 */

#endif /* _SAMRH707F18A_GPIO_H_ */

